[NoCoverage] BlockStatement
src/tools.ts:4:60
 type ObjectWithChildren<T> = T & { children: ObjectWithChildren<T>[] };
 export function getAllChildren<Z>(
     root: ObjectWithChildren<Z>
-): { target: ObjectWithChildren<Z>; familySize: number }[] {
-    if (root.children.length) {
-        const childs: { target: ObjectWithChildren<Z>; familySize: number }[] = [];
-        for (const child of root.children) {
-            childs.push(...getAllChildren<ObjectWithChildren<Z>>(child));
-        }
-
-        return [{ target: root, familySize: childs.length + 1 }, ...childs];
-    } else {
-        return [{ target: root, familySize: 1 }];
-    }
-}
+): { target: ObjectWithChildren<Z>; familySize: number }[] {}
 
 export function targetObjectInTree<T, Z>(

[NoCoverage] ConditionalExpression
src/tools.ts:5:9
 export function getAllChildren<Z>(
     root: ObjectWithChildren<Z>
 ): { target: ObjectWithChildren<Z>; familySize: number }[] {
-    if (root.children.length) {
+    if (false) {
         const childs: { target: ObjectWithChildren<Z>; familySize: number }[] = [];
         for (const child of root.children) {

[NoCoverage] ConditionalExpression
src/tools.ts:5:9
 export function getAllChildren<Z>(
     root: ObjectWithChildren<Z>
 ): { target: ObjectWithChildren<Z>; familySize: number }[] {
-    if (root.children.length) {
+    if (true) {
         const childs: { target: ObjectWithChildren<Z>; familySize: number }[] = [];
         for (const child of root.children) {

[NoCoverage] ArrayDeclaration
src/tools.ts:6:81
     root: ObjectWithChildren<Z>
 ): { target: ObjectWithChildren<Z>; familySize: number }[] {
     if (root.children.length) {
-        const childs: { target: ObjectWithChildren<Z>; familySize: number }[] = [];
+        const childs: { target: ObjectWithChildren<Z>; familySize: number }[] = ["Stryker was here"];
         for (const child of root.children) {
             childs.push(...getAllChildren<ObjectWithChildren<Z>>(child));

[NoCoverage] BlockStatement
src/tools.ts:7:44
 ): { target: ObjectWithChildren<Z>; familySize: number }[] {
     if (root.children.length) {
         const childs: { target: ObjectWithChildren<Z>; familySize: number }[] = [];
-        for (const child of root.children) {
-            childs.push(...getAllChildren<ObjectWithChildren<Z>>(child));
-        }
+        for (const child of root.children) {}
 
         return [{ target: root, familySize: childs.length + 1 }, ...childs];

[NoCoverage] ArithmeticOperator
src/tools.ts:11:45
             childs.push(...getAllChildren<ObjectWithChildren<Z>>(child));
         }
 
-        return [{ target: root, familySize: childs.length + 1 }, ...childs];
+        return [{ target: root, familySize: childs.length - 1 }, ...childs];
     } else {
         return [{ target: root, familySize: 1 }];

[NoCoverage] ArrayDeclaration
src/tools.ts:11:16
             childs.push(...getAllChildren<ObjectWithChildren<Z>>(child));
         }
 
-        return [{ target: root, familySize: childs.length + 1 }, ...childs];
+        return [];
     } else {
         return [{ target: root, familySize: 1 }];

[NoCoverage] BlockStatement
src/tools.ts:12:12
         }
 
         return [{ target: root, familySize: childs.length + 1 }, ...childs];
-    } else {
-        return [{ target: root, familySize: 1 }];
-    }
+    } else {}
 }
 

[NoCoverage] ObjectLiteral
src/tools.ts:13:17
 
         return [{ target: root, familySize: childs.length + 1 }, ...childs];
     } else {
-        return [{ target: root, familySize: 1 }];
+        return [{}];
     }
 }

[NoCoverage] BlockStatement
src/tools.ts:21:60
     root: ObjectWithChildren<T>,
     targetKeyValue: Z[],
     key: keyof ObjectWithChildren<T>
-): { target: ObjectWithChildren<T>; familySize: number }[] {
-    return getAllChildren(root).reduce((acc: { target: ObjectWithChildren<T>; familySize: number }[], curr) => {
-        // TODO: bypass typescript safe mechanism with 'as', find a type safe method to secure targetEntityInTree call
-        const currentTargetKeyValue = Reflect.get(curr.target, key) as Z;
-        if (targetKeyValue.includes(currentTargetKeyValue)) {
-            const idsInAcc = acc.map((el) => Reflect.get(el.target, key));
-            acc.push(
-                ...getAllChildren(curr.target).filter((child) => !idsInAcc.includes(Reflect.get(child.target, key)))
-            );
-        }
-
-        return acc;
-    }, []);
-}
+): { target: ObjectWithChildren<T>; familySize: number }[] {}
 

[NoCoverage] BlockStatement
src/tools.ts:22:112
     targetKeyValue: Z[],
     key: keyof ObjectWithChildren<T>
 ): { target: ObjectWithChildren<T>; familySize: number }[] {
-    return getAllChildren(root).reduce((acc: { target: ObjectWithChildren<T>; familySize: number }[], curr) => {
-        // TODO: bypass typescript safe mechanism with 'as', find a type safe method to secure targetEntityInTree call
-        const currentTargetKeyValue = Reflect.get(curr.target, key) as Z;
-        if (targetKeyValue.includes(currentTargetKeyValue)) {
-            const idsInAcc = acc.map((el) => Reflect.get(el.target, key));
-            acc.push(
-                ...getAllChildren(curr.target).filter((child) => !idsInAcc.includes(Reflect.get(child.target, key)))
-            );
-        }
-
-        return acc;
-    }, []);
+    return getAllChildren(root).reduce((acc: { target: ObjectWithChildren<T>; familySize: number }[], curr) => {}, []);
 }
 

[NoCoverage] BlockStatement
src/tools.ts:25:61
     return getAllChildren(root).reduce((acc: { target: ObjectWithChildren<T>; familySize: number }[], curr) => {
         // TODO: bypass typescript safe mechanism with 'as', find a type safe method to secure targetEntityInTree call
         const currentTargetKeyValue = Reflect.get(curr.target, key) as Z;
-        if (targetKeyValue.includes(currentTargetKeyValue)) {
-            const idsInAcc = acc.map((el) => Reflect.get(el.target, key));
-            acc.push(
-                ...getAllChildren(curr.target).filter((child) => !idsInAcc.includes(Reflect.get(child.target, key)))
-            );
-        }
+        if (targetKeyValue.includes(currentTargetKeyValue)) {}
 
         return acc;

[NoCoverage] ConditionalExpression
src/tools.ts:25:13
     return getAllChildren(root).reduce((acc: { target: ObjectWithChildren<T>; familySize: number }[], curr) => {
         // TODO: bypass typescript safe mechanism with 'as', find a type safe method to secure targetEntityInTree call
         const currentTargetKeyValue = Reflect.get(curr.target, key) as Z;
-        if (targetKeyValue.includes(currentTargetKeyValue)) {
+        if (false) {
             const idsInAcc = acc.map((el) => Reflect.get(el.target, key));
             acc.push(

[NoCoverage] ArrowFunction
src/tools.ts:26:38
         // TODO: bypass typescript safe mechanism with 'as', find a type safe method to secure targetEntityInTree call
         const currentTargetKeyValue = Reflect.get(curr.target, key) as Z;
         if (targetKeyValue.includes(currentTargetKeyValue)) {
-            const idsInAcc = acc.map((el) => Reflect.get(el.target, key));
+            const idsInAcc = acc.map(() => undefined);
             acc.push(
                 ...getAllChildren(curr.target).filter((child) => !idsInAcc.includes(Reflect.get(child.target, key)))

[NoCoverage] BooleanLiteral
src/tools.ts:28:66
         if (targetKeyValue.includes(currentTargetKeyValue)) {
             const idsInAcc = acc.map((el) => Reflect.get(el.target, key));
             acc.push(
-                ...getAllChildren(curr.target).filter((child) => !idsInAcc.includes(Reflect.get(child.target, key)))
+                ...getAllChildren(curr.target).filter((child) => idsInAcc.includes(Reflect.get(child.target, key)))
             );
         }

[NoCoverage] MethodExpression
src/tools.ts:28:20
         if (targetKeyValue.includes(currentTargetKeyValue)) {
             const idsInAcc = acc.map((el) => Reflect.get(el.target, key));
             acc.push(
-                ...getAllChildren(curr.target).filter((child) => !idsInAcc.includes(Reflect.get(child.target, key)))
+                ...getAllChildren(curr.target)
             );
         }
