[Timeout] ConditionalExpression
src/console/logger.ts:20:13
         error: Error | AxiosError,
         data: { source: string; code: number; customMessage?: string; information?: Record<string, unknown> }
     ) {
-        if (this.isAxiosErrorInstance(error)) {
+        if (false) {
             this.code = error.response?.status ?? data.code;
             this.isAxiosError = true;

[Timeout] ConditionalExpression
src/console/logger.ts:20:13
         error: Error | AxiosError,
         data: { source: string; code: number; customMessage?: string; information?: Record<string, unknown> }
     ) {
-        if (this.isAxiosErrorInstance(error)) {
+        if (true) {
             this.code = error.response?.status ?? data.code;
             this.isAxiosError = true;

[NoCoverage] LogicalOperator
src/console/logger.ts:21:25
         data: { source: string; code: number; customMessage?: string; information?: Record<string, unknown> }
     ) {
         if (this.isAxiosErrorInstance(error)) {
-            this.code = error.response?.status ?? data.code;
+            this.code = error.response?.status && data.code;
             this.isAxiosError = true;
             this.message = error.response?.statusText ?? data.customMessage ?? "Hu ho something went wrong";

[NoCoverage] OptionalChaining
src/console/logger.ts:21:25
         data: { source: string; code: number; customMessage?: string; information?: Record<string, unknown> }
     ) {
         if (this.isAxiosErrorInstance(error)) {
-            this.code = error.response?.status ?? data.code;
+            this.code = error.response.status ?? data.code;
             this.isAxiosError = true;
             this.message = error.response?.statusText ?? data.customMessage ?? "Hu ho something went wrong";

[NoCoverage] BooleanLiteral
src/console/logger.ts:22:33
     ) {
         if (this.isAxiosErrorInstance(error)) {
             this.code = error.response?.status ?? data.code;
-            this.isAxiosError = true;
+            this.isAxiosError = false;
             this.message = error.response?.statusText ?? data.customMessage ?? "Hu ho something went wrong";
             this.source = data.source;

[NoCoverage] LogicalOperator
src/console/logger.ts:23:28
         if (this.isAxiosErrorInstance(error)) {
             this.code = error.response?.status ?? data.code;
             this.isAxiosError = true;
-            this.message = error.response?.statusText ?? data.customMessage ?? "Hu ho something went wrong";
+            this.message = (error.response?.statusText ?? data.customMessage) && "Hu ho something went wrong";
             this.source = data.source;
             this.information = data.information ?? {

[NoCoverage] OptionalChaining
src/console/logger.ts:23:28
         if (this.isAxiosErrorInstance(error)) {
             this.code = error.response?.status ?? data.code;
             this.isAxiosError = true;
-            this.message = error.response?.statusText ?? data.customMessage ?? "Hu ho something went wrong";
+            this.message = error.response.statusText ?? data.customMessage ?? "Hu ho something went wrong";
             this.source = data.source;
             this.information = data.information ?? {

[NoCoverage] LogicalOperator
src/console/logger.ts:25:32
             this.isAxiosError = true;
             this.message = error.response?.statusText ?? data.customMessage ?? "Hu ho something went wrong";
             this.source = data.source;
-            this.information = data.information ?? {
-                baseUrl: error.response?.config?.baseURL,
-                url: error.response?.config?.url,
-                method: error.response?.config?.method,
-            };
+            this.information = data.information && {
+  baseUrl: error.response?.config?.baseURL,
+  url: error.response?.config?.url,
+  method: error.response?.config?.method
+};
         } else {
             this.code = Reflect.get(error, "code") || data.code;

[NoCoverage] OptionalChaining
src/console/logger.ts:26:26
             this.message = error.response?.statusText ?? data.customMessage ?? "Hu ho something went wrong";
             this.source = data.source;
             this.information = data.information ?? {
-                baseUrl: error.response?.config?.baseURL,
+                baseUrl: error.response?.config.baseURL,
                 url: error.response?.config?.url,
                 method: error.response?.config?.method,

[NoCoverage] OptionalChaining
src/console/logger.ts:26:26
             this.message = error.response?.statusText ?? data.customMessage ?? "Hu ho something went wrong";
             this.source = data.source;
             this.information = data.information ?? {
-                baseUrl: error.response?.config?.baseURL,
+                baseUrl: error.response.config?.baseURL,
                 url: error.response?.config?.url,
                 method: error.response?.config?.method,

[NoCoverage] OptionalChaining
src/console/logger.ts:27:22
             this.source = data.source;
             this.information = data.information ?? {
                 baseUrl: error.response?.config?.baseURL,
-                url: error.response?.config?.url,
+                url: error.response?.config.url,
                 method: error.response?.config?.method,
             };

[NoCoverage] OptionalChaining
src/console/logger.ts:27:22
             this.source = data.source;
             this.information = data.information ?? {
                 baseUrl: error.response?.config?.baseURL,
-                url: error.response?.config?.url,
+                url: error.response.config?.url,
                 method: error.response?.config?.method,
             };

[NoCoverage] OptionalChaining
src/console/logger.ts:28:25
             this.information = data.information ?? {
                 baseUrl: error.response?.config?.baseURL,
                 url: error.response?.config?.url,
-                method: error.response?.config?.method,
+                method: error.response.config?.method,
             };
         } else {

[NoCoverage] OptionalChaining
src/console/logger.ts:28:25
             this.information = data.information ?? {
                 baseUrl: error.response?.config?.baseURL,
                 url: error.response?.config?.url,
-                method: error.response?.config?.method,
+                method: error.response?.config.method,
             };
         } else {

[Timeout] BlockStatement
src/console/logger.ts:30:16
                 url: error.response?.config?.url,
                 method: error.response?.config?.method,
             };
-        } else {
-            this.code = Reflect.get(error, "code") || data.code;
-            this.isAxiosError = false;
-            this.message = data.customMessage ?? error.message;
-            this.source = data.source;
-            this.stack = error.stack;
-            this.information = data.information ?? {
-                name: error.name,
-            };
-        }
+        } else {}
 
         if (!this.code || typeof this.code !== "number" || this.code < 100 || this.code > 599) {

[Timeout] LogicalOperator
src/console/logger.ts:31:25
                 method: error.response?.config?.method,
             };
         } else {
-            this.code = Reflect.get(error, "code") || data.code;
+            this.code = Reflect.get(error, "code") && data.code;
             this.isAxiosError = false;
             this.message = data.customMessage ?? error.message;

[Timeout] ConditionalExpression
src/console/logger.ts:31:25
                 method: error.response?.config?.method,
             };
         } else {
-            this.code = Reflect.get(error, "code") || data.code;
+            this.code = false;
             this.isAxiosError = false;
             this.message = data.customMessage ?? error.message;

[Timeout] BooleanLiteral
src/console/logger.ts:32:33
             };
         } else {
             this.code = Reflect.get(error, "code") || data.code;
-            this.isAxiosError = false;
+            this.isAxiosError = true;
             this.message = data.customMessage ?? error.message;
             this.source = data.source;

[Timeout] LogicalOperator
src/console/logger.ts:33:28
         } else {
             this.code = Reflect.get(error, "code") || data.code;
             this.isAxiosError = false;
-            this.message = data.customMessage ?? error.message;
+            this.message = data.customMessage && error.message;
             this.source = data.source;
             this.stack = error.stack;

[Timeout] LogicalOperator
src/console/logger.ts:36:32
             this.message = data.customMessage ?? error.message;
             this.source = data.source;
             this.stack = error.stack;
-            this.information = data.information ?? {
-                name: error.name,
-            };
+            this.information = data.information && {
+  name: error.name
+};
         }
 

[Timeout] ConditionalExpression
src/console/logger.ts:41:13
             };
         }
 
-        if (!this.code || typeof this.code !== "number" || this.code < 100 || this.code > 599) {
+        if (true) {
             this.information["errorCode"] = this.code;
             this.code = 500;

[Timeout] BlockStatement
src/console/logger.ts:41:96
             };
         }
 
-        if (!this.code || typeof this.code !== "number" || this.code < 100 || this.code > 599) {
-            this.information["errorCode"] = this.code;
-            this.code = 500;
-        }
+        if (!this.code || typeof this.code !== "number" || this.code < 100 || this.code > 599) {}
         this.result = { code: this.code, message: this.message };
         this.code === 406 && (this.result.information = this.information);

[Timeout] ConditionalExpression
src/console/logger.ts:46:9
             this.code = 500;
         }
         this.result = { code: this.code, message: this.message };
-        this.code === 406 && (this.result.information = this.information);
+        true;
     }
 

[Timeout] ConditionalExpression
src/console/logger.ts:46:9
             this.code = 500;
         }
         this.result = { code: this.code, message: this.message };
-        this.code === 406 && (this.result.information = this.information);
+        true && (this.result.information = this.information);
     }
 

[Timeout] BlockStatement
src/console/logger.ts:49:71
         this.code === 406 && (this.result.information = this.information);
     }
 
-    isAxiosErrorInstance = (object: unknown): object is AxiosError => {
-        if (object && typeof object === "object") {
-            return "isAxiosError" in object;
-        }
-
-        return false;
-    };
+    isAxiosErrorInstance = (object: unknown): object is AxiosError => {};
 }
 

[Timeout] ConditionalExpression
src/console/logger.ts:50:13
     }
 
     isAxiosErrorInstance = (object: unknown): object is AxiosError => {
-        if (object && typeof object === "object") {
+        if (false) {
             return "isAxiosError" in object;
         }

[Timeout] LogicalOperator
src/console/logger.ts:50:13
     }
 
     isAxiosErrorInstance = (object: unknown): object is AxiosError => {
-        if (object && typeof object === "object") {
+        if (object || typeof object === "object") {
             return "isAxiosError" in object;
         }

[Timeout] StringLiteral
src/console/logger.ts:51:20
 
     isAxiosErrorInstance = (object: unknown): object is AxiosError => {
         if (object && typeof object === "object") {
-            return "isAxiosError" in object;
+            return "" in object;
         }
 

[Timeout] StringLiteral
src/console/logger.ts:71:20
     const config = {
         color: {
             info: "\x1b[32m",
-            error: "\x1b[31m",
+            error: "",
             warn: "\x1b[33m",
             debug: "\x1b[33m",

[Timeout] StringLiteral
src/console/logger.ts:78:24
         },
         style: {
             bold: "\x1b[1m",
-            resetBold: "\x1b[22m",
+            resetBold: "",
             italic: "\x1b[3m",
             resetItalic: "\x1b[23m",

[Survived] MethodExpression
src/console/logger.ts:89:14
     return data.level.includes("error")
         ? `${config.color[data.level]}${config.style.italic}${data.timestamp}${config.style.resetItalic} ${
               config.style.bold
-          }${data.level.toUpperCase()} ${data.code} : ${config.style.resetBold}${data.source} -> ${data.message} \r\n${
+          }${data.level.toLowerCase()} ${data.code} : ${config.style.resetBold}${data.source} -> ${data.message} \r\n${
               config.style.italic
           } AxiosError: ${data.isAxiosError}.${config.reset}${

[NoCoverage] StringLiteral
src/console/logger.ts:92:62
           }${data.level.toUpperCase()} ${data.code} : ${config.style.resetBold}${data.source} -> ${data.message} \r\n${
               config.style.italic
           } AxiosError: ${data.isAxiosError}.${config.reset}${
-              data.stack ? `\r\n Stack :" + ${data.stack}` : ""
+              data.stack ? `\r\n Stack :" + ${data.stack}` : "Stryker was here!"
           } \r\n Info: ${JSON.stringify(data.information, null, 2)}`
         : `${config.color[data.level]}${config.style.italic}${data.timestamp}${config.style.resetItalic} ${

[NoCoverage] StringLiteral
src/console/logger.ts:94:11
           } AxiosError: ${data.isAxiosError}.${config.reset}${
               data.stack ? `\r\n Stack :" + ${data.stack}` : ""
           } \r\n Info: ${JSON.stringify(data.information, null, 2)}`
-        : `${config.color[data.level]}${config.style.italic}${data.timestamp}${config.style.resetItalic} ${
-              config.style.bold
-          }${data.level.toUpperCase()}${config.style.resetBold} : ${data.message}`;
+        : ``;
 }
 

[NoCoverage] MethodExpression
src/console/logger.ts:96:14
           } \r\n Info: ${JSON.stringify(data.information, null, 2)}`
         : `${config.color[data.level]}${config.style.italic}${data.timestamp}${config.style.resetItalic} ${
               config.style.bold
-          }${data.level.toUpperCase()}${config.style.resetBold} : ${data.message}`;
+          }${data.level.toLowerCase()}${config.style.resetBold} : ${data.message}`;
 }
 
