[NoCoverage] ArrowFunction
src/console/morganMiddleware.ts:9:12
 // Morgan to use our custom logger instead of the console.log.
 const stream: StreamOptions = {
     // Use the http severity
-    write: (message) => Logger.http(message),
+    write: () => undefined,
 };
 

[NoCoverage] BlockStatement
src/console/morganMiddleware.ts:17:29
 // This method is not really needed here since
 // we already told to the logger that it should print
 // only warning and error messages in production.
-const skip = (): boolean => {
-    const env = process.env.NODE_ENV || "development";
-
-    return env !== "development";
-};
+const skip = (): boolean => {};
 
 // Build the morgan middleware

[NoCoverage] LogicalOperator
src/console/morganMiddleware.ts:18:17
 // we already told to the logger that it should print
 // only warning and error messages in production.
 const skip = (): boolean => {
-    const env = process.env.NODE_ENV || "development";
+    const env = process.env.NODE_ENV && "development";
 
     return env !== "development";

[NoCoverage] ConditionalExpression
src/console/morganMiddleware.ts:18:17
 // we already told to the logger that it should print
 // only warning and error messages in production.
 const skip = (): boolean => {
-    const env = process.env.NODE_ENV || "development";
+    const env = true;
 
     return env !== "development";

[NoCoverage] ConditionalExpression
src/console/morganMiddleware.ts:20:12
 const skip = (): boolean => {
     const env = process.env.NODE_ENV || "development";
 
-    return env !== "development";
+    return true;
 };
 

[NoCoverage] EqualityOperator
src/console/morganMiddleware.ts:20:12
 const skip = (): boolean => {
     const env = process.env.NODE_ENV || "development";
 
-    return env !== "development";
+    return env === "development";
 };
 
