[NoCoverage] BlockStatement
src/db/mongoDBConnection.ts:7:91
 
 dotenv.config();
 
-export async function connectToDB(database: string): Promise<typeof mongoose | undefined> {
-    try {
-        const port = process.env.DB_PORT ? process.env.DB_PORT : "27017";
-        const host = process.env.DB_HOST ? process.env.DB_HOST : "127.0.0.1";
-        const username = process.env.DB_USERNAME;
-        const password = process.env.DB_PASSWORD;
-        let credentials: string | undefined;
-        if (username && password) {
-            credentials = `${username}:${password}@`;
-        }
-        const connectionUrl = credentials
-            ? `mongodb://${credentials}${host}:${port}/${database}?authSource=admin`
-            : `mongodb://${host}:${port}/${database}`;
-        const connection = await mongoose.connect(connectionUrl);
-        logger.info(`connected to ${connection.connection.name} database`);
-
-        return connection;
-    } catch (error) {
-        logger.error("Error during database connection");
-    }
-}
+export async function connectToDB(database: string): Promise<typeof mongoose | undefined> {}
 

[NoCoverage] BlockStatement
src/db/mongoDBConnection.ts:8:9
 dotenv.config();
 
 export async function connectToDB(database: string): Promise<typeof mongoose | undefined> {
-    try {
-        const port = process.env.DB_PORT ? process.env.DB_PORT : "27017";
-        const host = process.env.DB_HOST ? process.env.DB_HOST : "127.0.0.1";
-        const username = process.env.DB_USERNAME;
-        const password = process.env.DB_PASSWORD;
-        let credentials: string | undefined;
-        if (username && password) {
-            credentials = `${username}:${password}@`;
-        }
-        const connectionUrl = credentials
-            ? `mongodb://${credentials}${host}:${port}/${database}?authSource=admin`
-            : `mongodb://${host}:${port}/${database}`;
-        const connection = await mongoose.connect(connectionUrl);
-        logger.info(`connected to ${connection.connection.name} database`);
-
-        return connection;
-    } catch (error) {
+    try {} catch (error) {
         logger.error("Error during database connection");
     }

[NoCoverage] StringLiteral
src/db/mongoDBConnection.ts:9:66
 
 export async function connectToDB(database: string): Promise<typeof mongoose | undefined> {
     try {
-        const port = process.env.DB_PORT ? process.env.DB_PORT : "27017";
+        const port = process.env.DB_PORT ? process.env.DB_PORT : "";
         const host = process.env.DB_HOST ? process.env.DB_HOST : "127.0.0.1";
         const username = process.env.DB_USERNAME;

[NoCoverage] LogicalOperator
src/db/mongoDBConnection.ts:14:13
         const username = process.env.DB_USERNAME;
         const password = process.env.DB_PASSWORD;
         let credentials: string | undefined;
-        if (username && password) {
+        if (username || password) {
             credentials = `${username}:${password}@`;
         }

[NoCoverage] ConditionalExpression
src/db/mongoDBConnection.ts:14:13
         const username = process.env.DB_USERNAME;
         const password = process.env.DB_PASSWORD;
         let credentials: string | undefined;
-        if (username && password) {
+        if (false) {
             credentials = `${username}:${password}@`;
         }

[NoCoverage] BlockStatement
src/db/mongoDBConnection.ts:24:21
         logger.info(`connected to ${connection.connection.name} database`);
 
         return connection;
-    } catch (error) {
-        logger.error("Error during database connection");
-    }
+    } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/db/mongoDBConnection.ts:25:22
 
         return connection;
     } catch (error) {
-        logger.error("Error during database connection");
+        logger.error("");
     }
 }
