[NoCoverage] BlockStatement
src/index.ts:13:9
 const { NODE_ENV, LOCAL_URL, LOCAL_PORT, NLU_SERVER_URL, NLU_SECRET } = process.env;
 
 (async () => {
-    try {
-        if (NODE_ENV !== "test") {
-            if (!LOCAL_URL || !LOCAL_PORT || !NLU_SERVER_URL || !NLU_SECRET) {
-                throw new Error("Missing environment variables");
-            }
-            await connectToDB("chatbot");
-            await connectToNlu();
-
-            // TODO: implement a functionnal https server
-            // https
-            //     .createServer(
-            //         {
-            //             rejectUnauthorized: true,
-            //             cert: FS.readFileSync(`./certificates/${SERVICE_CRT}`),
-            //             key: FS.readFileSync(`./certificates/${SERVICE_KEY}`),
-            //             requestCert: true,
-            //             passphrase: SECRET,
-            //         },
-            //         app
-            //     )
-            //     .listen(LOCAL_PORT, () => logger.info(`server running on port: ${LOCAL_PORT}`));
-
-            http.createServer(app).listen(LOCAL_PORT, () => logger.info(`server running on port: ${LOCAL_PORT}`));
-        }
-    } catch (error) {
+    try {} catch (error) {
         logger.error(`Hu ho server says : ${error}`);
     }

[NoCoverage] BlockStatement
src/index.ts:14:34
 
 (async () => {
     try {
-        if (NODE_ENV !== "test") {
-            if (!LOCAL_URL || !LOCAL_PORT || !NLU_SERVER_URL || !NLU_SECRET) {
-                throw new Error("Missing environment variables");
-            }
-            await connectToDB("chatbot");
-            await connectToNlu();
-
-            // TODO: implement a functionnal https server
-            // https
-            //     .createServer(
-            //         {
-            //             rejectUnauthorized: true,
-            //             cert: FS.readFileSync(`./certificates/${SERVICE_CRT}`),
-            //             key: FS.readFileSync(`./certificates/${SERVICE_KEY}`),
-            //             requestCert: true,
-            //             passphrase: SECRET,
-            //         },
-            //         app
-            //     )
-            //     .listen(LOCAL_PORT, () => logger.info(`server running on port: ${LOCAL_PORT}`));
-
-            http.createServer(app).listen(LOCAL_PORT, () => logger.info(`server running on port: ${LOCAL_PORT}`));
-        }
+        if (NODE_ENV !== "test") {}
     } catch (error) {
         logger.error(`Hu ho server says : ${error}`);

[NoCoverage] ConditionalExpression
src/index.ts:14:13
 
 (async () => {
     try {
-        if (NODE_ENV !== "test") {
+        if (false) {
             if (!LOCAL_URL || !LOCAL_PORT || !NLU_SERVER_URL || !NLU_SECRET) {
                 throw new Error("Missing environment variables");

[NoCoverage] BooleanLiteral
src/index.ts:15:17
 (async () => {
     try {
         if (NODE_ENV !== "test") {
-            if (!LOCAL_URL || !LOCAL_PORT || !NLU_SERVER_URL || !NLU_SECRET) {
+            if (LOCAL_URL || !LOCAL_PORT || !NLU_SERVER_URL || !NLU_SECRET) {
                 throw new Error("Missing environment variables");
             }

[NoCoverage] LogicalOperator
src/index.ts:15:17
 (async () => {
     try {
         if (NODE_ENV !== "test") {
-            if (!LOCAL_URL || !LOCAL_PORT || !NLU_SERVER_URL || !NLU_SECRET) {
+            if (!LOCAL_URL && !LOCAL_PORT || !NLU_SERVER_URL || !NLU_SECRET) {
                 throw new Error("Missing environment variables");
             }

[NoCoverage] ArrowFunction
src/index.ts:35:55
             //     )
             //     .listen(LOCAL_PORT, () => logger.info(`server running on port: ${LOCAL_PORT}`));
 
-            http.createServer(app).listen(LOCAL_PORT, () => logger.info(`server running on port: ${LOCAL_PORT}`));
+            http.createServer(app).listen(LOCAL_PORT, () => undefined);
         }
     } catch (error) {

[NoCoverage] BlockStatement
src/index.ts:37:21
 
             http.createServer(app).listen(LOCAL_PORT, () => logger.info(`server running on port: ${LOCAL_PORT}`));
         }
-    } catch (error) {
-        logger.error(`Hu ho server says : ${error}`);
-    }
+    } catch (error) {}
 })();
 
