[Killed] BlockStatement
src/managers/fileManager.ts:4:28
 import { Flow } from "../types";
 import FS from "../wrapper/fs";
 
-export const FLOWS = () => {
-    /* istanbul ignore next */
-    if (process.env.NODE_ENV !== "test") {
-        return process.env.FLOWSFOLDER ?? "./flows";
-    } else {
-        return "./src/tests/__mock__/flows";
-    }
-};
+export const FLOWS = () => {};
 
 export const MAPPING = () => {
killedBy: stepRunner Should handle recursivity and flow switch if step has waitForUserInput set to false and follow coord has a different flow than current flow
statusReason: Error: ENOENT: no such file or directory, open 'undefined/hello.json'

[Killed] ConditionalExpression
src/managers/fileManager.ts:6:9
 
 export const FLOWS = () => {
     /* istanbul ignore next */
-    if (process.env.NODE_ENV !== "test") {
+    if (true) {
         return process.env.FLOWSFOLDER ?? "./flows";
     } else {
killedBy: stepRunner Should handle recursivity and flow switch if step has waitForUserInput set to false and follow coord has a different flow than current flow
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "flow": "bye",
-   "stepId": 1,

[Killed] EqualityOperator
src/managers/fileManager.ts:6:9
 
 export const FLOWS = () => {
     /* istanbul ignore next */
-    if (process.env.NODE_ENV !== "test") {
+    if (process.env.NODE_ENV === "test") {
         return process.env.FLOWSFOLDER ?? "./flows";
     } else {
killedBy: stepRunner Should handle recursivity and flow switch if step has waitForUserInput set to false and follow coord has a different flow than current flow
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "flow": "bye",
-   "stepId": 1,

[NoCoverage] LogicalOperator
src/managers/fileManager.ts:7:16
 export const FLOWS = () => {
     /* istanbul ignore next */
     if (process.env.NODE_ENV !== "test") {
-        return process.env.FLOWSFOLDER ?? "./flows";
+        return process.env.FLOWSFOLDER && "./flows";
     } else {
         return "./src/tests/__mock__/flows";

[Killed] BlockStatement
src/managers/fileManager.ts:8:12
     /* istanbul ignore next */
     if (process.env.NODE_ENV !== "test") {
         return process.env.FLOWSFOLDER ?? "./flows";
-    } else {
-        return "./src/tests/__mock__/flows";
-    }
+    } else {}
 };
 
killedBy: stepRunner Should handle recursivity and flow switch if step has waitForUserInput set to false and follow coord has a different flow than current flow
statusReason: Error: ENOENT: no such file or directory, open 'undefined/hello.json'

[Killed] StringLiteral
src/managers/fileManager.ts:9:16
     if (process.env.NODE_ENV !== "test") {
         return process.env.FLOWSFOLDER ?? "./flows";
     } else {
-        return "./src/tests/__mock__/flows";
+        return "";
     }
 };
killedBy: stepRunner Should handle recursivity and flow switch if step has waitForUserInput set to false and follow coord has a different flow than current flow
statusReason: Error: ENOENT: no such file or directory, open '/hello.json'

[Killed] BlockStatement
src/managers/fileManager.ts:13:30
     }
 };
 
-export const MAPPING = () => {
-    /* istanbul ignore next */
-    if (process.env.NODE_ENV !== "test") {
-        return process.env.CONFIGFOLDER ?? "./config";
-    } else {
-        return "./src/tests/__mock__/config";
-    }
-};
+export const MAPPING = () => {};
 
 export function fileReader(folder: string, filenameWithoutExtension: string): Flow {
killedBy: stepRunner Should fallback if intent doesn't correspond to an existing flow
statusReason: Error: ENOENT: no such file or directory, open 'undefined/mapping.json'

[Survived] ConditionalExpression
src/managers/fileManager.ts:15:9
 
 export const MAPPING = () => {
     /* istanbul ignore next */
-    if (process.env.NODE_ENV !== "test") {
+    if (false) {
         return process.env.CONFIGFOLDER ?? "./config";
     } else {

[NoCoverage] LogicalOperator
src/managers/fileManager.ts:16:16
 export const MAPPING = () => {
     /* istanbul ignore next */
     if (process.env.NODE_ENV !== "test") {
-        return process.env.CONFIGFOLDER ?? "./config";
+        return process.env.CONFIGFOLDER && "./config";
     } else {
         return "./src/tests/__mock__/config";

[NoCoverage] StringLiteral
src/managers/fileManager.ts:16:44
 export const MAPPING = () => {
     /* istanbul ignore next */
     if (process.env.NODE_ENV !== "test") {
-        return process.env.CONFIGFOLDER ?? "./config";
+        return process.env.CONFIGFOLDER ?? "";
     } else {
         return "./src/tests/__mock__/config";

[Killed] BlockStatement
src/managers/fileManager.ts:17:12
     /* istanbul ignore next */
     if (process.env.NODE_ENV !== "test") {
         return process.env.CONFIGFOLDER ?? "./config";
-    } else {
-        return "./src/tests/__mock__/config";
-    }
+    } else {}
 };
 
killedBy: stepRunner Should fallback if intent doesn't correspond to an existing flow
statusReason: Error: ENOENT: no such file or directory, open 'undefined/mapping.json'

[Killed] StringLiteral
src/managers/fileManager.ts:18:16
     if (process.env.NODE_ENV !== "test") {
         return process.env.CONFIGFOLDER ?? "./config";
     } else {
-        return "./src/tests/__mock__/config";
+        return "";
     }
 };
killedBy: stepRunner Should fallback if intent doesn't correspond to an existing flow
statusReason: Error: ENOENT: no such file or directory, open '/mapping.json'

[Killed] BlockStatement
src/managers/fileManager.ts:22:84
     }
 };
 
-export function fileReader(folder: string, filenameWithoutExtension: string): Flow {
-    return JSON.parse(String(FS.readFileSync(`${folder}/${filenameWithoutExtension}.json`, "utf-8")));
-}
+export function fileReader(folder: string, filenameWithoutExtension: string): Flow {}
 
killedBy: stepRunner Should handle recursivity and flow switch if step has waitForUserInput set to false and follow coord has a different flow than current flow
statusReason: TypeError: Cannot read properties of undefined (reading 'steps')

[Survived] StringLiteral
src/managers/fileManager.ts:23:92
 };
 
 export function fileReader(folder: string, filenameWithoutExtension: string): Flow {
-    return JSON.parse(String(FS.readFileSync(`${folder}/${filenameWithoutExtension}.json`, "utf-8")));
+    return JSON.parse(String(FS.readFileSync(`${folder}/${filenameWithoutExtension}.json`, "")));
 }
 
