[NoCoverage] ObjectLiteral
src/server.ts:19:24
 app.use(helmet());
 app.use(morganMiddleware);
 app.use(
-    express.urlencoded({
-        extended: true,
-    })
+    express.urlencoded({})
 );
 app.use(express.json());

[NoCoverage] BooleanLiteral
src/server.ts:20:19
 app.use(morganMiddleware);
 app.use(
     express.urlencoded({
-        extended: true,
+        extended: false,
     })
 );

[NoCoverage] LogicalOperator
src/server.ts:24:26
     })
 );
 app.use(express.json());
-const localUrl = new URL(process.env.LOCAL_URL ?? "");
+const localUrl = new URL(process.env.LOCAL_URL && "");
 let corsOrigin;
 if (localUrl.hostname.split(".").length > 2) {

[NoCoverage] BlockStatement
src/server.ts:26:46
 app.use(express.json());
 const localUrl = new URL(process.env.LOCAL_URL ?? "");
 let corsOrigin;
-if (localUrl.hostname.split(".").length > 2) {
-    corsOrigin = new RegExp(localUrl.hostname.slice(localUrl.hostname.indexOf(".") + 1) + "(:[0-9]{3,4}){0,1}");
-}
+if (localUrl.hostname.split(".").length > 2) {}
 app.use(cors({ origin: corsOrigin ?? true, credentials: true }));
 

[NoCoverage] ConditionalExpression
src/server.ts:26:5
 app.use(express.json());
 const localUrl = new URL(process.env.LOCAL_URL ?? "");
 let corsOrigin;
-if (localUrl.hostname.split(".").length > 2) {
+if (true) {
     corsOrigin = new RegExp(localUrl.hostname.slice(localUrl.hostname.indexOf(".") + 1) + "(:[0-9]{3,4}){0,1}");
 }

[NoCoverage] ArithmeticOperator
src/server.ts:27:53
 const localUrl = new URL(process.env.LOCAL_URL ?? "");
 let corsOrigin;
 if (localUrl.hostname.split(".").length > 2) {
-    corsOrigin = new RegExp(localUrl.hostname.slice(localUrl.hostname.indexOf(".") + 1) + "(:[0-9]{3,4}){0,1}");
+    corsOrigin = new RegExp(localUrl.hostname.slice(localUrl.hostname.indexOf(".") - 1) + "(:[0-9]{3,4}){0,1}");
 }
 app.use(cors({ origin: corsOrigin ?? true, credentials: true }));

[NoCoverage] MethodExpression
src/server.ts:27:29
 const localUrl = new URL(process.env.LOCAL_URL ?? "");
 let corsOrigin;
 if (localUrl.hostname.split(".").length > 2) {
-    corsOrigin = new RegExp(localUrl.hostname.slice(localUrl.hostname.indexOf(".") + 1) + "(:[0-9]{3,4}){0,1}");
+    corsOrigin = new RegExp(localUrl.hostname + "(:[0-9]{3,4}){0,1}");
 }
 app.use(cors({ origin: corsOrigin ?? true, credentials: true }));

[NoCoverage] BooleanLiteral
src/server.ts:29:57
 if (localUrl.hostname.split(".").length > 2) {
     corsOrigin = new RegExp(localUrl.hostname.slice(localUrl.hostname.indexOf(".") + 1) + "(:[0-9]{3,4}){0,1}");
 }
-app.use(cors({ origin: corsOrigin ?? true, credentials: true }));
+app.use(cors({ origin: corsOrigin ?? true, credentials: false }));
 
 app.use("/apiDocs", swaggerUi.serve, swaggerUi.setup(swaggerDoc));

[NoCoverage] LogicalOperator
src/server.ts:29:24
 if (localUrl.hostname.split(".").length > 2) {
     corsOrigin = new RegExp(localUrl.hostname.slice(localUrl.hostname.indexOf(".") + 1) + "(:[0-9]{3,4}){0,1}");
 }
-app.use(cors({ origin: corsOrigin ?? true, credentials: true }));
+app.use(cors({ origin: corsOrigin && true, credentials: true }));
 
 app.use("/apiDocs", swaggerUi.serve, swaggerUi.setup(swaggerDoc));
