[NoCoverage] BlockStatement
src/types.ts:37:59
     message: string;
     data: T;
 
-    constructor(source: string, message: string, data: T) {
-        this.source = source;
-        this.message = message;
-        this.data = data;
-    }
+    constructor(source: string, message: string, data: T) {}
 }
 export interface Session {
