[NoCoverage] ConditionalExpression
src/wrapper/fs.ts:23:35
             | null
     ) => fs.readdirSync(path, options),
     existsSync: (path: string): boolean => fs.existsSync(path),
-    isDirEmpty: (path: string) => fs.readdirSync(path).length === 0,
+    isDirEmpty: (path: string) => true,
     readFileSync: (
         path: PathOrFileDescriptor,

[NoCoverage] ConditionalExpression
src/wrapper/fs.ts:23:35
             | null
     ) => fs.readdirSync(path, options),
     existsSync: (path: string): boolean => fs.existsSync(path),
-    isDirEmpty: (path: string) => fs.readdirSync(path).length === 0,
+    isDirEmpty: (path: string) => false,
     readFileSync: (
         path: PathOrFileDescriptor,
