[Killed] BlockStatement
src/controllers/speak.ts:17:9
     >
 ): Promise<Response> {
     let session: Session | undefined;
-    try {
-        session = await getSessionById(req.params.sessionId);
-        if (!session) {
-            session = await sessionBuilder({
-                nextStep: { flow: "main", stepId: 1 },
-                flow: "main",
-                status: SessionStatus.BUSY,
-            });
-        } else if (session.status === SessionStatus.BUSY || session.status === SessionStatus.CLOSED) {
-            throw new Error("Session is unavailable");
-        }
-
-        await updateSession({ id: session.id, status: SessionStatus.BUSY });
-
-        // TODO: flow should be stored in db and seeded at service startup
-        const sessionAndSay = await stepRunner(session, fileReader(FLOWS(), session.flow), req.body.say);
-
-        await updateSession({ id: session.id, status: SessionStatus.AVAILABLE });
-
-        return res.status(200).json({
-            session: sessionCleaner(sessionAndSay.session),
-            say: sessionAndSay.say,
-        });
-    } catch (error) {
+    try {} catch (error) {
         logger.error(
             new BotError(error, {
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/speak.ts:19:13
     let session: Session | undefined;
     try {
         session = await getSessionById(req.params.sessionId);
-        if (!session) {
+        if (true) {
             session = await sessionBuilder({
                 nextStep: { flow: "main", stepId: 1 },
killedBy: speak should handle an existing session
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- ObjectContaining {"flow": "main", "history": [], "nextStep": ObjectContaining {"flow": "main", "stepId": 3}, "stacktrace": [], "status": 0},
+ {"__v": 0, "_id": "6486e82a61c4f9960a43b273", "flow": "main", "history": [], "id": "6486e82a61c4f9960a43b273", "nextStep": {"_id": "6486e82a61c4f9960a43b274", "flow": "main

[Killed] BooleanLiteral
src/controllers/speak.ts:19:13
     let session: Session | undefined;
     try {
         session = await getSessionById(req.params.sessionId);
-        if (!session) {
+        if (session) {
             session = await sessionBuilder({
                 nextStep: { flow: "main", stepId: 1 },
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ObjectLiteral
src/controllers/speak.ts:20:44
     try {
         session = await getSessionById(req.params.sessionId);
         if (!session) {
-            session = await sessionBuilder({
-                nextStep: { flow: "main", stepId: 1 },
-                flow: "main",
-                status: SessionStatus.BUSY,
-            });
+            session = await sessionBuilder({});
         } else if (session.status === SessionStatus.BUSY || session.status === SessionStatus.CLOSED) {
             throw new Error("Session is unavailable");
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- ObjectContaining {"flow": "main", "history": [], "nextStep": ObjectContaining {"flow": "main"}, "stacktrace": [], "status": 1},
+ {"__v": 0, "_id": "6486e82a563b4e69a1dcd3d9", "history": [], "id": "6486e82a563b4e69a1dcd3d9", "stacktrace": [], "status": 0},

[Killed] ObjectLiteral
src/controllers/speak.ts:21:27
         session = await getSessionById(req.params.sessionId);
         if (!session) {
             session = await sessionBuilder({
-                nextStep: { flow: "main", stepId: 1 },
+                nextStep: {},
                 flow: "main",
                 status: SessionStatus.BUSY,
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- ObjectContaining {"flow": "main", "history": [], "nextStep": ObjectContaining {"flow": "main"}, "stacktrace": [], "status": 1},
+ {"__v": 0, "_id": "6486e82a47d25df7e02678c5", "flow": "main", "history": [], "id": "6486e82a47d25df7e02678c5", "nextStep": {"_id": "6486e82a47d25df7e02678c6"}, "stacktrace": [], "status

[Killed] StringLiteral
src/controllers/speak.ts:22:23
         if (!session) {
             session = await sessionBuilder({
                 nextStep: { flow: "main", stepId: 1 },
-                flow: "main",
+                flow: "",
                 status: SessionStatus.BUSY,
             });
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- ObjectContaining {"flow": "main", "history": [], "nextStep": ObjectContaining {"flow": "main"}, "stacktrace": [], "status": 1},
+ {"__v": 0, "_id": "6486e82a07fe0cb82daf1190", "flow": "", "history": [], "id": "6486e82a07fe0cb82daf1190", "nextStep": {"_id": "6486e82a07fe0cb82daf1191", "flow": "main", "stepId": 1},

[Killed] ConditionalExpression
src/controllers/speak.ts:25:20
                 flow: "main",
                 status: SessionStatus.BUSY,
             });
-        } else if (session.status === SessionStatus.BUSY || session.status === SessionStatus.CLOSED) {
+        } else if (false || session.status === SessionStatus.CLOSED) {
             throw new Error("Session is unavailable");
         }
killedBy: speak should handle session having busy status
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Session is unavailable",
+   "error": "ENOENT: no such file or directory, open './src/tests/__mock__/flows/main.json'",

[Killed] ConditionalExpression
src/controllers/speak.ts:25:20
                 flow: "main",
                 status: SessionStatus.BUSY,
             });
-        } else if (session.status === SessionStatus.BUSY || session.status === SessionStatus.CLOSED) {
+        } else if (false) {
             throw new Error("Session is unavailable");
         }
killedBy: speak should handle session having busy status
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": "Session is unavailable",
+   "error": "ENOENT: no such file or directory, open './src/tests/__mock__/flows/main.json'",

[Killed] ObjectLiteral
src/controllers/speak.ts:34:29
         // TODO: flow should be stored in db and seeded at service startup
         const sessionAndSay = await stepRunner(session, fileReader(FLOWS(), session.flow), req.body.say);
 
-        await updateSession({ id: session.id, status: SessionStatus.AVAILABLE });
+        await updateSession({});
 
         return res.status(200).json({
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 6

  Array [
-   ObjectContaining {
+   Object {

[Killed] ObjectLiteral
src/controllers/speak.ts:36:37
 
         await updateSession({ id: session.id, status: SessionStatus.AVAILABLE });
 
-        return res.status(200).json({
-            session: sessionCleaner(sessionAndSay.session),
-            say: sessionAndSay.say,
-        });
+        return res.status(200).json({});
     } catch (error) {
         logger.error(
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "say": Object {
-     "message": "Hello my name is roboto, how do you do?",

[Killed] BlockStatement
src/controllers/speak.ts:40:21
             session: sessionCleaner(sessionAndSay.session),
             say: sessionAndSay.say,
         });
-    } catch (error) {
-        logger.error(
-            new BotError(error, {
-                source: speak.name,
-                customMessage: "Speaking with roboto seems to be complicated at the moment",
-                code: error.code,
-            })
-        );
-
-        return res
-            .status(500)
-            .json(
-                session
-                    ? { session: sessionCleaner(session), error: error.message }
-                    : { session: undefined, error: error.message }
-            );
-    }
+    } catch (error) {}
 }
 
killedBy: speak should handle error and return a proper status and json payload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] ObjectLiteral
src/controllers/speak.ts:42:33
         });
     } catch (error) {
         logger.error(
-            new BotError(error, {
-                source: speak.name,
-                customMessage: "Speaking with roboto seems to be complicated at the moment",
-                code: error.code,
-            })
+            new BotError(error, {})
         );
 

[Survived] StringLiteral
src/controllers/speak.ts:44:32
         logger.error(
             new BotError(error, {
                 source: speak.name,
-                customMessage: "Speaking with roboto seems to be complicated at the moment",
+                customMessage: "",
                 code: error.code,
             })
