[Killed] BlockStatement
src/managers/nlu.ts:6:53
 import { Document as YamlDocument } from "yaml";
 import logger from "../console/logger";
 
-export async function connectToNlu(): Promise<void> {
-    try {
-        await axios({
-            method: "GET",
-            url: `${process.env.NLU_SERVER_URL}/?token=${process.env.NLU_SECRET}`,
-            headers: {
-                Accept: "application/json",
-            },
-        });
-        logger.info("connected to NLU server");
-    } catch (error) {
-        logger.info("retry to connect to NLU server");
-        await new Promise((resolve) => setTimeout(resolve, 1000));
-
-        return await connectToNlu();
-    }
-}
+export async function connectToNlu(): Promise<void> {}
 
 export async function findIntent(message: string): Promise<{ name: string; info: Record<string, unknown> }> {
killedBy: connectToNlu should connect to nlu
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "connected to NLU server"

Number of calls: 0

[Killed] BlockStatement
src/managers/nlu.ts:7:9
 import logger from "../console/logger";
 
 export async function connectToNlu(): Promise<void> {
-    try {
-        await axios({
-            method: "GET",
-            url: `${process.env.NLU_SERVER_URL}/?token=${process.env.NLU_SECRET}`,
-            headers: {
-                Accept: "application/json",
-            },
-        });
-        logger.info("connected to NLU server");
-    } catch (error) {
+    try {} catch (error) {
         logger.info("retry to connect to NLU server");
         await new Promise((resolve) => setTimeout(resolve, 1000));
killedBy: connectToNlu should connect to nlu
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "connected to NLU server"

Number of calls: 0

[Survived] ObjectLiteral
src/managers/nlu.ts:11:22
         await axios({
             method: "GET",
             url: `${process.env.NLU_SERVER_URL}/?token=${process.env.NLU_SECRET}`,
-            headers: {
-                Accept: "application/json",
-            },
+            headers: {},
         });
         logger.info("connected to NLU server");

[Killed] BlockStatement
src/managers/nlu.ts:16:21
             },
         });
         logger.info("connected to NLU server");
-    } catch (error) {
-        logger.info("retry to connect to NLU server");
-        await new Promise((resolve) => setTimeout(resolve, 1000));
-
-        return await connectToNlu();
-    }
+    } catch (error) {}
 }
 
killedBy: connectToNlu should fail to connect to nlu and retry after a delay
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "retry to connect to NLU server"

Number of calls: 0

[Killed] StringLiteral
src/managers/nlu.ts:17:21
         });
         logger.info("connected to NLU server");
     } catch (error) {
-        logger.info("retry to connect to NLU server");
+        logger.info("");
         await new Promise((resolve) => setTimeout(resolve, 1000));
 
killedBy: connectToNlu should fail to connect to nlu and retry after a delay
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "retry to connect to NLU server"
Received
->     1: ""
       2: "connected to NLU server"

[Timeout] ArrowFunction
src/managers/nlu.ts:18:27
         logger.info("connected to NLU server");
     } catch (error) {
         logger.info("retry to connect to NLU server");
-        await new Promise((resolve) => setTimeout(resolve, 1000));
+        await new Promise(() => undefined);
 
         return await connectToNlu();

[Killed] BlockStatement
src/managers/nlu.ts:24:109
     }
 }
 
-export async function findIntent(message: string): Promise<{ name: string; info: Record<string, unknown> }> {
-    const response: AxiosResponse = await axios({
-        method: "POST",
-        url: `${process.env.NLU_SERVER_URL}/model/parse?token=${process.env.NLU_SECRET}`,
-        headers: {
-            "Content-Type": "application/json",
-        },
-        data: {
-            text: message,
-        },
-    });
-
-    return { name: response.data.intent.name, info: response.data };
-}
+export async function findIntent(message: string): Promise<{ name: string; info: Record<string, unknown> }> {}
 
 export async function getAllDomainInfo(): Promise<NLUDomain> {
killedBy: findIntent Should return intent from nlu server
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"info": {"intent": {"name": "greeting"}}, "name": "greeting"}
Received: undefined

[Survived] ObjectLiteral
src/managers/nlu.ts:28:18
     const response: AxiosResponse = await axios({
         method: "POST",
         url: `${process.env.NLU_SERVER_URL}/model/parse?token=${process.env.NLU_SECRET}`,
-        headers: {
-            "Content-Type": "application/json",
-        },
+        headers: {},
         data: {
             text: message,

[Survived] ObjectLiteral
src/managers/nlu.ts:31:15
         headers: {
             "Content-Type": "application/json",
         },
-        data: {
-            text: message,
-        },
+        data: {},
     });
 

[Killed] ObjectLiteral
src/managers/nlu.ts:36:12
         },
     });
 
-    return { name: response.data.intent.name, info: response.data };
+    return {};
 }
 
killedBy: findIntent Should return intent from nlu server
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "info": Object {
-     "intent": Object {

[Killed] BlockStatement
src/managers/nlu.ts:39:62
     return { name: response.data.intent.name, info: response.data };
 }
 
-export async function getAllDomainInfo(): Promise<NLUDomain> {
-    const res = await axios({
-        method: "GET",
-        url: `${process.env.NLU_SERVER_URL}/domain?token=${process.env.NLU_SECRET}`,
-        headers: {
-            Accept: "application/json",
-        },
-    });
-
-    return res.data;
-}
+export async function getAllDomainInfo(): Promise<NLUDomain> {}
 
 export async function trainNewModel(model: NluModel): Promise<void> {
killedBy: getAllDomainInfo should return data from response
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"intents": [{"toto": {}}]}
Received: undefined

[Survived] ObjectLiteral
src/managers/nlu.ts:40:29
 }
 
 export async function getAllDomainInfo(): Promise<NLUDomain> {
-    const res = await axios({
-        method: "GET",
-        url: `${process.env.NLU_SERVER_URL}/domain?token=${process.env.NLU_SECRET}`,
-        headers: {
-            Accept: "application/json",
-        },
-    });
+    const res = await axios({});
 
     return res.data;

[Survived] ObjectLiteral
src/managers/nlu.ts:43:18
     const res = await axios({
         method: "GET",
         url: `${process.env.NLU_SERVER_URL}/domain?token=${process.env.NLU_SECRET}`,
-        headers: {
-            Accept: "application/json",
-        },
+        headers: {},
     });
 

[Killed] BlockStatement
src/managers/nlu.ts:51:69
     return res.data;
 }
 
-export async function trainNewModel(model: NluModel): Promise<void> {
-    const yamlModel = new YamlDocument();
-    Reflect.set(yamlModel, "contents", model);
-    await axios({
-        method: "POST",
-        url: `${process.env.NLU_SERVER_URL}/model/train?token=${process.env.NLU_SECRET}`,
-        headers: {
-            Accept: "application/yaml",
-        },
-        data: yamlModel.toString(),
-    });
-}
+export async function trainNewModel(model: NluModel): Promise<void> {}
 
killedBy: trainNewModel should convert argument into YAML
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": Any<String>, "headers": {"Accept": "application/yaml"}, "method": "POST", "url": "http://172.17.0.2:5005/model/train?token=yesterdayIsTurfu"}

Number of calls: 0

[Killed] StringLiteral
src/managers/nlu.ts:55:17
     const yamlModel = new YamlDocument();
     Reflect.set(yamlModel, "contents", model);
     await axios({
-        method: "POST",
+        method: "",
         url: `${process.env.NLU_SERVER_URL}/model/train?token=${process.env.NLU_SECRET}`,
         headers: {
killedBy: trainNewModel should convert argument into YAML
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": Any<String>, "headers": {"Accept": "application/yaml"}, "method": "POST", "url": "http://172.17.0.2:5005/model/train?token=yesterdayIsTurfu"}
Received: {"data": "pipeline: []
policies: []
intents: []
entities: []
slots: {}

[Killed] ObjectLiteral
src/managers/nlu.ts:57:18
     await axios({
         method: "POST",
         url: `${process.env.NLU_SERVER_URL}/model/train?token=${process.env.NLU_SECRET}`,
-        headers: {
-            Accept: "application/yaml",
-        },
+        headers: {},
         data: yamlModel.toString(),
     });
killedBy: trainNewModel should convert argument into YAML
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": Any<String>, "headers": {"Accept": "application/yaml"}, "method": "POST", "url": "http://172.17.0.2:5005/model/train?token=yesterdayIsTurfu"}
Received: {"data": "pipeline: []
policies: []
intents: []
entities: []
slots: {}
