[Killed] BlockStatement
src/managers/stepManager.ts:7:90
 import { Flow, Say, Session, SessionStatus, Step } from "../types";
 import { findIntent } from "./nlu";
 
-export function stepFinder(flow: Flow, pointer: { flow: string; stepId?: number }): Step {
-    const step = flow.steps.find((el: Step) => el.stepId === (pointer.stepId ?? flow.startingId));
-
-    if (!step) {
-        // SHOULD NEVER HAPPEN if flow are correctly built and check
-        throw new Error("Cannot find corresponding step");
-    }
-
-    return step;
-}
+export function stepFinder(flow: Flow, pointer: { flow: string; stepId?: number }): Step {}
 
 export function getDeepValue(session: Session, path: string): string {
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: TypeError: Cannot read properties of undefined (reading 'say')

[Killed] ArrowFunction
src/managers/stepManager.ts:8:34
 import { findIntent } from "./nlu";
 
 export function stepFinder(flow: Flow, pointer: { flow: string; stepId?: number }): Step {
-    const step = flow.steps.find((el: Step) => el.stepId === (pointer.stepId ?? flow.startingId));
+    const step = flow.steps.find(() => undefined);
 
     if (!step) {
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: Error: Cannot find corresponding step

[Killed] ConditionalExpression
src/managers/stepManager.ts:8:48
 import { findIntent } from "./nlu";
 
 export function stepFinder(flow: Flow, pointer: { flow: string; stepId?: number }): Step {
-    const step = flow.steps.find((el: Step) => el.stepId === (pointer.stepId ?? flow.startingId));
+    const step = flow.steps.find((el: Step) => true);
 
     if (!step) {
killedBy: stepRunner Should handle step say and replace special wrapper with Hu ho if absent from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "See you next time Hu Ho",
+   "message": "Hello, your session flow is basic",

[Killed] BooleanLiteral
src/managers/stepManager.ts:10:9
 export function stepFinder(flow: Flow, pointer: { flow: string; stepId?: number }): Step {
     const step = flow.steps.find((el: Step) => el.stepId === (pointer.stepId ?? flow.startingId));
 
-    if (!step) {
+    if (step) {
         // SHOULD NEVER HAPPEN if flow are correctly built and check
         throw new Error("Cannot find corresponding step");
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: Error: Cannot find corresponding step

[Timeout] ConditionalExpression
src/managers/stepManager.ts:10:9
 export function stepFinder(flow: Flow, pointer: { flow: string; stepId?: number }): Step {
     const step = flow.steps.find((el: Step) => el.stepId === (pointer.stepId ?? flow.startingId));
 
-    if (!step) {
+    if (false) {
         // SHOULD NEVER HAPPEN if flow are correctly built and check
         throw new Error("Cannot find corresponding step");

[Killed] StringLiteral
src/managers/stepManager.ts:12:25
 
     if (!step) {
         // SHOULD NEVER HAPPEN if flow are correctly built and check
-        throw new Error("Cannot find corresponding step");
+        throw new Error("");
     }
 
killedBy: stepFinder SHOULD NEVER HAPPEN if flow are correctly built and check !!
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Cannot find corresponding step"
Received: ""

[Killed] BlockStatement
src/managers/stepManager.ts:18:70
     return step;
 }
 
-export function getDeepValue(session: Session, path: string): string {
-    try {
-        const keyChain = path.split(".");
-        let data = session;
-        for (const key of keyChain) {
-            data = Reflect.get(data, key);
-        }
-
-        return String(data);
-    } catch (error) {
-        logger.error(new BotError(error, { source: getDeepValue.name, code: 500, customMessage: error.message }));
-
-        return "Hu Ho";
-    }
-}
+export function getDeepValue(session: Session, path: string): string {}
 
 export async function stepRunner(session: Session, flow: Flow, userSay: Say): Promise<{ session: Session; say: Say }> {
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Hello, your session flow is basic",
+   "message": "Hello, your session flow is undefined",

[Timeout] BlockStatement
src/managers/stepManager.ts:19:9
 }
 
 export function getDeepValue(session: Session, path: string): string {
-    try {
-        const keyChain = path.split(".");
-        let data = session;
-        for (const key of keyChain) {
-            data = Reflect.get(data, key);
-        }
-
-        return String(data);
-    } catch (error) {
+    try {} catch (error) {
         logger.error(new BotError(error, { source: getDeepValue.name, code: 500, customMessage: error.message }));
 

[Killed] BlockStatement
src/managers/stepManager.ts:22:37
     try {
         const keyChain = path.split(".");
         let data = session;
-        for (const key of keyChain) {
-            data = Reflect.get(data, key);
-        }
+        for (const key of keyChain) {}
 
         return String(data);
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Hello, your session flow is basic",
+   "message": "Hello, your session flow is [object Object]",

[Killed] BlockStatement
src/managers/stepManager.ts:27:21
         }
 
         return String(data);
-    } catch (error) {
-        logger.error(new BotError(error, { source: getDeepValue.name, code: 500, customMessage: error.message }));
-
-        return "Hu Ho";
-    }
+    } catch (error) {}
 }
 
killedBy: stepRunner Should handle step say and replace special wrapper with Hu ho if absent from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "See you next time Hu Ho",
+   "message": "See you next time undefined",

[Timeout] ObjectLiteral
src/managers/stepManager.ts:28:42
 
         return String(data);
     } catch (error) {
-        logger.error(new BotError(error, { source: getDeepValue.name, code: 500, customMessage: error.message }));
+        logger.error(new BotError(error, {}));
 
         return "Hu Ho";

[Killed] BlockStatement
src/managers/stepManager.ts:37:39
 export async function stepRunner(session: Session, flow: Flow, userSay: Say): Promise<{ session: Session; say: Say }> {
     const step = stepFinder(flow, session.nextStep);
 
-    if (step.say && step.say.message) {
-        // detect variables in bot message
-        const match = step.say.message.match(/\${([\w.]*)}/m);
-        if (match) {
-            // Assign value to bot message
-            step.say.message = step.say.message.replace(match[0], getDeepValue(session, match[1]));
-        }
-    }
+    if (step.say && step.say.message) {}
 
     switch (step.action) {
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Hello, your session flow is basic",
+   "message": "Hello, your session flow is ${flow}",

[Killed] ConditionalExpression
src/managers/stepManager.ts:37:9
 export async function stepRunner(session: Session, flow: Flow, userSay: Say): Promise<{ session: Session; say: Say }> {
     const step = stepFinder(flow, session.nextStep);
 
-    if (step.say && step.say.message) {
+    if (true) {
         // detect variables in bot message
         const match = step.say.message.match(/\${([\w.]*)}/m);
killedBy: stepRunner Should fallback if intent doesn't correspond to an existing flow
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] Regex
src/managers/stepManager.ts:39:46
 
     if (step.say && step.say.message) {
         // detect variables in bot message
-        const match = step.say.message.match(/\${([\w.]*)}/m);
+        const match = step.say.message.match(/\${([\W.]*)}/m);
         if (match) {
             // Assign value to bot message
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Hello, your session flow is basic",
+   "message": "Hello, your session flow is ${flow}",

[Killed] ConditionalExpression
src/managers/stepManager.ts:40:13
     if (step.say && step.say.message) {
         // detect variables in bot message
         const match = step.say.message.match(/\${([\w.]*)}/m);
-        if (match) {
+        if (true) {
             // Assign value to bot message
             step.say.message = step.say.message.replace(match[0], getDeepValue(session, match[1]));
killedBy: stepRunner Should handle recursivity and flow switch if step has waitForUserInput set to false and follow coord has a different flow than current flow
statusReason: TypeError: Cannot read properties of null (reading '0')

[Timeout] ConditionalExpression
src/managers/stepManager.ts:40:13
     if (step.say && step.say.message) {
         // detect variables in bot message
         const match = step.say.message.match(/\${([\w.]*)}/m);
-        if (match) {
+        if (false) {
             // Assign value to bot message
             step.say.message = step.say.message.replace(match[0], getDeepValue(session, match[1]));

[Timeout] ConditionalExpression
src/managers/stepManager.ts:47:9
     }
 
     switch (step.action) {
-        case "endSession":
-            session.status = SessionStatus.CLOSED;
-            session.nextStep = step.follow.nextCoord;
-
-            break;
+        case "endSession":
 
         case "targetFlow": {

[Timeout] StringLiteral
src/managers/stepManager.ts:47:14
     }
 
     switch (step.action) {
-        case "endSession":
+        case "":
             session.status = SessionStatus.CLOSED;
             session.nextStep = step.follow.nextCoord;

[Killed] BlockStatement
src/managers/stepManager.ts:53:28
 
             break;
 
-        case "targetFlow": {
-            // Decide which flow to follow by looking at user intent from nlu server
-            const foundIntent = await findIntent(userSay.message);
-            const flow = Object.entries(fileReader(MAPPING(), "mapping")).reduce((acc, [flow, intents]) => {
-                if (Array.isArray(intents) && intents.includes(foundIntent.name)) {
-                    acc = flow;
-                }
-
-                return acc;
-            }, "");
-            session.nextStep = flow
-                ? { flow, stepId: step.follow.nextCoord.stepId ?? fileReader(FLOWS(), flow).startingId }
-                : step.follow.fallbackCoord;
-            break;
-        }
+        case "targetFlow": {}
 
         case "saveSessionVariables":
killedBy: stepRunner Should fallback if intent doesn't correspond to an existing flow
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
-   "flow": "mocker",
    "stepId": 1,

[Timeout] ConditionalExpression
src/managers/stepManager.ts:53:9
 
             break;
 
-        case "targetFlow": {
-            // Decide which flow to follow by looking at user intent from nlu server
-            const foundIntent = await findIntent(userSay.message);
-            const flow = Object.entries(fileReader(MAPPING(), "mapping")).reduce((acc, [flow, intents]) => {
-                if (Array.isArray(intents) && intents.includes(foundIntent.name)) {
-                    acc = flow;
-                }
-
-                return acc;
-            }, "");
-            session.nextStep = flow
-                ? { flow, stepId: step.follow.nextCoord.stepId ?? fileReader(FLOWS(), flow).startingId }
-                : step.follow.fallbackCoord;
-            break;
-        }
+        case "targetFlow":
 
         case "saveSessionVariables":

[Killed] BlockStatement
src/managers/stepManager.ts:56:108
         case "targetFlow": {
             // Decide which flow to follow by looking at user intent from nlu server
             const foundIntent = await findIntent(userSay.message);
-            const flow = Object.entries(fileReader(MAPPING(), "mapping")).reduce((acc, [flow, intents]) => {
-                if (Array.isArray(intents) && intents.includes(foundIntent.name)) {
-                    acc = flow;
-                }
-
-                return acc;
-            }, "");
+            const flow = Object.entries(fileReader(MAPPING(), "mapping")).reduce((acc, [flow, intents]) => {}, "");
             session.nextStep = flow
                 ? { flow, stepId: step.follow.nextCoord.stepId ?? fileReader(FLOWS(), flow).startingId }
killedBy: targetFlow Should use mapping to target correct flow
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "flow": "hello",
+   "flow": "mocker",

[Killed] LogicalOperator
src/managers/stepManager.ts:57:21
             // Decide which flow to follow by looking at user intent from nlu server
             const foundIntent = await findIntent(userSay.message);
             const flow = Object.entries(fileReader(MAPPING(), "mapping")).reduce((acc, [flow, intents]) => {
-                if (Array.isArray(intents) && intents.includes(foundIntent.name)) {
+                if (Array.isArray(intents) || intents.includes(foundIntent.name)) {
                     acc = flow;
                 }
killedBy: stepRunner Should fallback if intent doesn't correspond to an existing flow
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "flow": "mocker",
+   "flow": "bye",

[Killed] ConditionalExpression
src/managers/stepManager.ts:57:21
             // Decide which flow to follow by looking at user intent from nlu server
             const foundIntent = await findIntent(userSay.message);
             const flow = Object.entries(fileReader(MAPPING(), "mapping")).reduce((acc, [flow, intents]) => {
-                if (Array.isArray(intents) && intents.includes(foundIntent.name)) {
+                if (false) {
                     acc = flow;
                 }
killedBy: targetFlow Should use mapping to target correct flow
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "flow": "hello",
+   "flow": "mocker",

[Killed] LogicalOperator
src/managers/stepManager.ts:64:35
                 return acc;
             }, "");
             session.nextStep = flow
-                ? { flow, stepId: step.follow.nextCoord.stepId ?? fileReader(FLOWS(), flow).startingId }
+                ? { flow, stepId: step.follow.nextCoord.stepId && fileReader(FLOWS(), flow).startingId }
                 : step.follow.fallbackCoord;
             break;
killedBy: targetFlow Should use starting id from targeted flow
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "flow": "hello",
-   "stepId": 1,

[Killed] ObjectLiteral
src/managers/stepManager.ts:64:19
                 return acc;
             }, "");
             session.nextStep = flow
-                ? { flow, stepId: step.follow.nextCoord.stepId ?? fileReader(FLOWS(), flow).startingId }
+                ? {}
                 : step.follow.fallbackCoord;
             break;
killedBy: targetFlow Should use mapping to target correct flow
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "flow": "hello",
-   "stepId": 1,

[Killed] ConditionalExpression
src/managers/stepManager.ts:69:9
             break;
         }
 
-        case "saveSessionVariables":
-            if (step.args) {
-                for (const [key, value] of Object.entries(step.args)) {
-                    Reflect.set(session.variables, key, value);
-                }
-            }
-            session.nextStep = step.follow.nextCoord;
-            break;
+        case "saveSessionVariables":
 
         case "saveSessionVariablesWithUserInput":
killedBy: saveSessionVariables should save variables from step args to session and return nextCoord
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

  Object {
-   "executionTime": 0.8,
-   "outputs": Array [

[Killed] BlockStatement
src/managers/stepManager.ts:70:28
         }
 
         case "saveSessionVariables":
-            if (step.args) {
-                for (const [key, value] of Object.entries(step.args)) {
-                    Reflect.set(session.variables, key, value);
-                }
-            }
+            if (step.args) {}
             session.nextStep = step.follow.nextCoord;
             break;
killedBy: saveSessionVariables should save variables from step args to session and return nextCoord
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Object {
-   "executionTime": 0.8,
-   "outputs": Array [

[Killed] ConditionalExpression
src/managers/stepManager.ts:70:17
         }
 
         case "saveSessionVariables":
-            if (step.args) {
+            if (false) {
                 for (const [key, value] of Object.entries(step.args)) {
                     Reflect.set(session.variables, key, value);
killedBy: saveSessionVariables should save variables from step args to session and return nextCoord
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Object {
-   "executionTime": 0.8,
-   "outputs": Array [

[Killed] BlockStatement
src/managers/stepManager.ts:71:71
 
         case "saveSessionVariables":
             if (step.args) {
-                for (const [key, value] of Object.entries(step.args)) {
-                    Reflect.set(session.variables, key, value);
-                }
+                for (const [key, value] of Object.entries(step.args)) {}
             }
             session.nextStep = step.follow.nextCoord;
killedBy: saveSessionVariables should save variables from step args to session and return nextCoord
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Object {
-   "executionTime": 0.8,
-   "outputs": Array [

[Killed] ConditionalExpression
src/managers/stepManager.ts:78:9
             session.nextStep = step.follow.nextCoord;
             break;
 
-        case "saveSessionVariablesWithUserInput":
-            if (step.args) {
-                Reflect.set(session.variables, Object.keys(step.args)[0], userSay.message);
-            }
-            session.nextStep = step.follow.nextCoord;
-
-            break;
+        case "saveSessionVariablesWithUserInput":
 
         default:
killedBy: saveSessionVariablesWithUserInput should save variables from step args with user input to session and return nextCoord
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "dynamicVariable": "toto is here",
- }

[Timeout] StringLiteral
src/managers/stepManager.ts:78:14
             session.nextStep = step.follow.nextCoord;
             break;
 
-        case "saveSessionVariablesWithUserInput":
+        case "":
             if (step.args) {
                 Reflect.set(session.variables, Object.keys(step.args)[0], userSay.message);

[Killed] ConditionalExpression
src/managers/stepManager.ts:79:17
             break;
 
         case "saveSessionVariablesWithUserInput":
-            if (step.args) {
+            if (false) {
                 Reflect.set(session.variables, Object.keys(step.args)[0], userSay.message);
             }
killedBy: saveSessionVariablesWithUserInput should save variables from step args with user input to session and return nextCoord
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "dynamicVariable": "toto is here",
- }

[Killed] BlockStatement
src/managers/stepManager.ts:79:28
             break;
 
         case "saveSessionVariablesWithUserInput":
-            if (step.args) {
-                Reflect.set(session.variables, Object.keys(step.args)[0], userSay.message);
-            }
+            if (step.args) {}
             session.nextStep = step.follow.nextCoord;
 
killedBy: saveSessionVariablesWithUserInput should save variables from step args with user input to session and return nextCoord
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "dynamicVariable": "toto is here",
- }

[Timeout] ConditionalExpression
src/managers/stepManager.ts:86:9
 
             break;
 
-        default:
-            // No known action in current step => set nextStep
-            session.nextStep = step.follow.nextCoord;
-            break;
+        default:
     }
 

[Killed] ConditionalExpression
src/managers/stepManager.ts:96:9
     session.stacktrace.push(step);
 
     // This is the only place where message should be saved
-    if (step.say && step.say.message) {
+    if (true) {
         // TODO: implement sending message through websocket, for now messaging is made with a ping pong mechanism
         session.history.push({ message: step.say.message });
killedBy: targetFlow Should use mapping to target correct flow
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] LogicalOperator
src/managers/stepManager.ts:96:9
     session.stacktrace.push(step);
 
     // This is the only place where message should be saved
-    if (step.say && step.say.message) {
+    if (step.say || step.say.message) {
         // TODO: implement sending message through websocket, for now messaging is made with a ping pong mechanism
         session.history.push({ message: step.say.message });
killedBy: stepRunner Should fallback if intent doesn't correspond to an existing flow
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
src/managers/stepManager.ts:101:26
         session.history.push({ message: step.say.message });
     }
 
-    if (step.checkpoint) {
-        session.checkpoint = { flow: step.flow, stepId: step.stepId };
-    }
+    if (step.checkpoint) {}
 
     // Update session with new value after each step
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"flow": "basic", "stepId": 1}
Received: undefined

[Killed] ConditionalExpression
src/managers/stepManager.ts:101:9
         session.history.push({ message: step.say.message });
     }
 
-    if (step.checkpoint) {
+    if (false) {
         session.checkpoint = { flow: step.flow, stepId: step.stepId };
     }
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"flow": "basic", "stepId": 1}
Received: undefined

[Killed] ConditionalExpression
src/managers/stepManager.ts:109:9
     session.flow = session.nextStep.flow;
     await updateSession(session);
 
-    if (!step.waitForUserInput) {
+    if (false) {
         const formattedFlowName = flow.name.replace(" ", "_");
         if (session.nextStep.flow !== formattedFlowName) {
killedBy: stepRunner Should handle step say and replace special wrapper with Hu ho if absent from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"flow": "basic", "stepId": 1}
Received: undefined

[Killed] BlockStatement
src/managers/stepManager.ts:109:33
     session.flow = session.nextStep.flow;
     await updateSession(session);
 
-    if (!step.waitForUserInput) {
-        const formattedFlowName = flow.name.replace(" ", "_");
-        if (session.nextStep.flow !== formattedFlowName) {
-            // Load new json corresponding to new flow
-            flow = fileReader(FLOWS(), session.nextStep.flow);
-            session.flow = formattedFlowName;
-        }
-
-        return await stepRunner(session, flow, userSay);
-    }
+    if (!step.waitForUserInput) {}
 
     // TODO: improve message handling if flow is badly build
killedBy: stepRunner Should handle step say and replace special wrapper with Hu ho if absent from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"flow": "basic", "stepId": 1}
Received: undefined

[Killed] StringLiteral
src/managers/stepManager.ts:110:53
     await updateSession(session);
 
     if (!step.waitForUserInput) {
-        const formattedFlowName = flow.name.replace(" ", "_");
+        const formattedFlowName = flow.name.replace("", "_");
         if (session.nextStep.flow !== formattedFlowName) {
             // Load new json corresponding to new flow
killedBy: stepRunner Should handle step say and replace special wrapper with Hu ho if absent from session
statusReason: Error: ENOENT: no such file or directory, open './src/tests/__mock__/flows/basic.json'

[Killed] ConditionalExpression
src/managers/stepManager.ts:111:13
 
     if (!step.waitForUserInput) {
         const formattedFlowName = flow.name.replace(" ", "_");
-        if (session.nextStep.flow !== formattedFlowName) {
+        if (true) {
             // Load new json corresponding to new flow
             flow = fileReader(FLOWS(), session.nextStep.flow);
killedBy: stepRunner Should handle step say and replace special wrapper with Hu ho if absent from session
statusReason: Error: ENOENT: no such file or directory, open './src/tests/__mock__/flows/basic.json'

[Killed] ConditionalExpression
src/managers/stepManager.ts:111:13
 
     if (!step.waitForUserInput) {
         const formattedFlowName = flow.name.replace(" ", "_");
-        if (session.nextStep.flow !== formattedFlowName) {
+        if (false) {
             // Load new json corresponding to new flow
             flow = fileReader(FLOWS(), session.nextStep.flow);
killedBy: stepRunner Should handle recursivity and flow switch if step has waitForUserInput set to false and follow coord has a different flow than current flow
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "flow": "bye",
-   "stepId": 1,

[Killed] OptionalChaining
src/managers/stepManager.ts:121:39
     }
 
     // TODO: improve message handling if flow is badly build
-    return { session, say: { message: step.say?.message ?? "Hu ho" } };
+    return { session, say: { message: step.say.message ?? "Hu ho" } };
 }
 
killedBy: stepRunner Should fallback if intent doesn't correspond to an existing flow
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] LogicalOperator
src/managers/stepManager.ts:121:39
     }
 
     // TODO: improve message handling if flow is badly build
-    return { session, say: { message: step.say?.message ?? "Hu ho" } };
+    return { session, say: { message: step.say?.message && "Hu ho" } };
 }
 
killedBy: stepRunner Should handle step say and replace special wrapper with value from session
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Hello, your session flow is basic"
Received: "Hu ho"
