[Timeout] BlockStatement
src/managers/sessionManager.ts:4:83
 import { SessionModel } from "../entities/Session";
 import { Session } from "../types";
 
-export async function sessionBuilder(session: Partial<Session>): Promise<Session> {
-    const userSession = new SessionModel(session);
-    const savedUserSession = await userSession.save();
-
-    return { id: savedUserSession._id, ...savedUserSession.toObject() };
-}
+export async function sessionBuilder(session: Partial<Session>): Promise<Session> {}
 
 export async function getSessionById(id: string): Promise<Session | undefined> {

[Timeout] ObjectLiteral
src/managers/sessionManager.ts:8:12
     const userSession = new SessionModel(session);
     const savedUserSession = await userSession.save();
 
-    return { id: savedUserSession._id, ...savedUserSession.toObject() };
+    return {};
 }
 

[Timeout] BlockStatement
src/managers/sessionManager.ts:11:80
     return { id: savedUserSession._id, ...savedUserSession.toObject() };
 }
 
-export async function getSessionById(id: string): Promise<Session | undefined> {
-    return (await SessionModel.findOne({ _id: id })) ?? undefined;
-}
+export async function getSessionById(id: string): Promise<Session | undefined> {}
 
 export async function updateSession(session: Partial<Session>): Promise<void> {

[Timeout] LogicalOperator
src/managers/sessionManager.ts:12:12
 }
 
 export async function getSessionById(id: string): Promise<Session | undefined> {
-    return (await SessionModel.findOne({ _id: id })) ?? undefined;
+    return (await SessionModel.findOne({
+  _id: id
+})) && undefined;
 }
 

[Timeout] BlockStatement
src/managers/sessionManager.ts:15:79
     return (await SessionModel.findOne({ _id: id })) ?? undefined;
 }
 
-export async function updateSession(session: Partial<Session>): Promise<void> {
-    await SessionModel.findByIdAndUpdate(session.id, { $set: session });
-}
+export async function updateSession(session: Partial<Session>): Promise<void> {}
 
 export function sessionCleaner(session: Session, keepKeys: string[] = ["id"]): Partial<Session> {

[Timeout] ObjectLiteral
src/managers/sessionManager.ts:16:54
 }
 
 export async function updateSession(session: Partial<Session>): Promise<void> {
-    await SessionModel.findByIdAndUpdate(session.id, { $set: session });
+    await SessionModel.findByIdAndUpdate(session.id, {});
 }
 

[Killed] BlockStatement
src/managers/sessionManager.ts:19:97
     await SessionModel.findByIdAndUpdate(session.id, { $set: session });
 }
 
-export function sessionCleaner(session: Session, keepKeys: string[] = ["id"]): Partial<Session> {
-    const reduceSession = keepKeys.reduce((acc: Partial<Session>, key: string) => {
-        Object.assign(acc, { [key]: Reflect.get(session, key) });
-
-        return acc;
-    }, {});
-
-    return reduceSession;
-}
+export function sessionCleaner(session: Session, keepKeys: string[] = ["id"]): Partial<Session> {}
 
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "say": Object {
      "message": "Hello my name is roboto, how do you do?",

[Killed] ArrayDeclaration
src/managers/sessionManager.ts:19:71
     await SessionModel.findByIdAndUpdate(session.id, { $set: session });
 }
 
-export function sessionCleaner(session: Session, keepKeys: string[] = ["id"]): Partial<Session> {
+export function sessionCleaner(session: Session, keepKeys: string[] = []): Partial<Session> {
     const reduceSession = keepKeys.reduce((acc: Partial<Session>, key: string) => {
         Object.assign(acc, { [key]: Reflect.get(session, key) });
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "say": Object {
      "message": "Hello my name is roboto, how do you do?",

[Killed] BlockStatement
src/managers/sessionManager.ts:20:83
 }
 
 export function sessionCleaner(session: Session, keepKeys: string[] = ["id"]): Partial<Session> {
-    const reduceSession = keepKeys.reduce((acc: Partial<Session>, key: string) => {
-        Object.assign(acc, { [key]: Reflect.get(session, key) });
-
-        return acc;
-    }, {});
+    const reduceSession = keepKeys.reduce((acc: Partial<Session>, key: string) => {}, {});
 
     return reduceSession;
killedBy: speak should create a session if it doesn't exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "say": Object {
      "message": "Hello my name is roboto, how do you do?",
