[Killed] BlockStatement
src/middlewares/handleSession.ts:6:117
 import { getSessionById, updateSession } from "../managers/sessionManager";
 import logger, { BotError } from "../console/logger";
 
-export async function checkSessionStatus(req: Request, res: Response, next: NextFunction): Promise<Response | void> {
-    try {
-        const session = await getSessionById(req.params.sessionId);
-        if (session?.status === SessionStatus.BUSY || session?.status === SessionStatus.CLOSED) {
-            throw new Error("Session is unavailable");
-        } else if (session) {
-            await updateSession({ id: session.id, status: SessionStatus.BUSY });
-        }
-        next();
-    } catch (error) {
-        const botError = new BotError(error, { source: checkSessionStatus.name, code: 403 });
-        logger.error(botError);
-
-        return res.status(botError.code).json({ code: botError.code, message: error.message });
-    }
-}
+export async function checkSessionStatus(req: Request, res: Response, next: NextFunction): Promise<Response | void> {}
 
 // TODO: trial and error with this middlware happening after controller run
killedBy: checkSessionStatus should let request pass if session id param is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/middlewares/handleSession.ts:7:9
 import logger, { BotError } from "../console/logger";
 
 export async function checkSessionStatus(req: Request, res: Response, next: NextFunction): Promise<Response | void> {
-    try {
-        const session = await getSessionById(req.params.sessionId);
-        if (session?.status === SessionStatus.BUSY || session?.status === SessionStatus.CLOSED) {
-            throw new Error("Session is unavailable");
-        } else if (session) {
-            await updateSession({ id: session.id, status: SessionStatus.BUSY });
-        }
-        next();
-    } catch (error) {
+    try {} catch (error) {
         const botError = new BotError(error, { source: checkSessionStatus.name, code: 403 });
         logger.error(botError);
killedBy: checkSessionStatus should let request pass if session id param is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/middlewares/handleSession.ts:9:55
 export async function checkSessionStatus(req: Request, res: Response, next: NextFunction): Promise<Response | void> {
     try {
         const session = await getSessionById(req.params.sessionId);
-        if (session?.status === SessionStatus.BUSY || session?.status === SessionStatus.CLOSED) {
+        if (session?.status === SessionStatus.BUSY || false) {
             throw new Error("Session is unavailable");
         } else if (session) {
killedBy: checkSessionStatus should NOT let request pass if session is closed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403

Number of calls: 0

[Killed] BlockStatement
src/middlewares/handleSession.ts:9:97
 export async function checkSessionStatus(req: Request, res: Response, next: NextFunction): Promise<Response | void> {
     try {
         const session = await getSessionById(req.params.sessionId);
-        if (session?.status === SessionStatus.BUSY || session?.status === SessionStatus.CLOSED) {
-            throw new Error("Session is unavailable");
-        } else if (session) {
+        if (session?.status === SessionStatus.BUSY || session?.status === SessionStatus.CLOSED) {} else if (session) {
             await updateSession({ id: session.id, status: SessionStatus.BUSY });
         }
killedBy: checkSessionStatus should NOT let request pass if session is busy
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403

Number of calls: 0

[Killed] ConditionalExpression
src/middlewares/handleSession.ts:11:20
         const session = await getSessionById(req.params.sessionId);
         if (session?.status === SessionStatus.BUSY || session?.status === SessionStatus.CLOSED) {
             throw new Error("Session is unavailable");
-        } else if (session) {
+        } else if (true) {
             await updateSession({ id: session.id, status: SessionStatus.BUSY });
         }
killedBy: checkSessionStatus should let request pass if session id param is undefined
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: 403

[Killed] ConditionalExpression
src/middlewares/handleSession.ts:11:20
         const session = await getSessionById(req.params.sessionId);
         if (session?.status === SessionStatus.BUSY || session?.status === SessionStatus.CLOSED) {
             throw new Error("Session is unavailable");
-        } else if (session) {
+        } else if (false) {
             await updateSession({ id: session.id, status: SessionStatus.BUSY });
         }
killedBy: checkSessionStatus should let request pass if session is not busy or closed and change its status to busy
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ObjectLiteral
src/middlewares/handleSession.ts:12:33
         if (session?.status === SessionStatus.BUSY || session?.status === SessionStatus.CLOSED) {
             throw new Error("Session is unavailable");
         } else if (session) {
-            await updateSession({ id: session.id, status: SessionStatus.BUSY });
+            await updateSession({});
         }
         next();
killedBy: checkSessionStatus should let request pass if session is not busy or closed and change its status to busy
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/middlewares/handleSession.ts:15:21
             await updateSession({ id: session.id, status: SessionStatus.BUSY });
         }
         next();
-    } catch (error) {
-        const botError = new BotError(error, { source: checkSessionStatus.name, code: 403 });
-        logger.error(botError);
-
-        return res.status(botError.code).json({ code: botError.code, message: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: checkSessionStatus should NOT let request pass if session is busy
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403

Number of calls: 0

[Killed] BlockStatement
src/middlewares/handleSession.ts:24:93
 }
 
 // TODO: trial and error with this middlware happening after controller run
-export async function restoreSessionStatus(req: Request, res: Response, next: NextFunction) {
-    const session = await getSessionById(req.params.sessionId);
-    if (session?.status !== SessionStatus.AVAILABLE) {
-        await updateSession({ id: req.params.sessionId, status: SessionStatus.AVAILABLE });
-    }
-    next();
-}
+export async function restoreSessionStatus(req: Request, res: Response, next: NextFunction) {}
 
killedBy: restoreSessionStatus should call next if session doesn't exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
src/middlewares/handleSession.ts:26:9
 // TODO: trial and error with this middlware happening after controller run
 export async function restoreSessionStatus(req: Request, res: Response, next: NextFunction) {
     const session = await getSessionById(req.params.sessionId);
-    if (session?.status !== SessionStatus.AVAILABLE) {
+    if (session?.status === SessionStatus.AVAILABLE) {
         await updateSession({ id: req.params.sessionId, status: SessionStatus.AVAILABLE });
     }
killedBy: restoreSessionStatus should restore session status
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] OptionalChaining
src/middlewares/handleSession.ts:26:9
 // TODO: trial and error with this middlware happening after controller run
 export async function restoreSessionStatus(req: Request, res: Response, next: NextFunction) {
     const session = await getSessionById(req.params.sessionId);
-    if (session?.status !== SessionStatus.AVAILABLE) {
+    if (session.status !== SessionStatus.AVAILABLE) {
         await updateSession({ id: req.params.sessionId, status: SessionStatus.AVAILABLE });
     }
killedBy: restoreSessionStatus should call next if session doesn't exists
statusReason: TypeError: Cannot read properties of undefined (reading 'status')
