[Timeout] BlockStatement
src/middlewares/validator.ts:4:82
 import { validationResult } from "express-validator";
 import { Response, Request, NextFunction } from "express";
 
-export function validator(req: Request, res: Response, next: NextFunction): void {
-    const errors = validationResult(req);
-    if (errors.isEmpty()) {
-        return next();
-    }
-    res.status(406).json({ code: 406, errors: errors.array() });
-}
+export function validator(req: Request, res: Response, next: NextFunction): void {}
 

[Killed] BlockStatement
src/middlewares/validator.ts:6:27
 
 export function validator(req: Request, res: Response, next: NextFunction): void {
     const errors = validationResult(req);
-    if (errors.isEmpty()) {
-        return next();
-    }
+    if (errors.isEmpty()) {}
     res.status(406).json({ code: 406, errors: errors.array() });
 }
killedBy: speakPayload should let request pass
statusReason: Error: expected 200 "OK", got 406 "Not Acceptable"

[Killed] ConditionalExpression
src/middlewares/validator.ts:6:9
 
 export function validator(req: Request, res: Response, next: NextFunction): void {
     const errors = validationResult(req);
-    if (errors.isEmpty()) {
+    if (false) {
         return next();
     }
killedBy: speakPayload should let request pass
statusReason: Error: expected 200 "OK", got 406 "Not Acceptable"
